{
  "Welcome to Math with Mr. J.": "0:00",
  "In this video, I'm going to go through an introduction to the Pythagorean Theorem.": "0:05",
  "Now, the Pythagorean Theorem has to do with right triangles and the relationship": "0:10",
  "between the sides of right triangles. It's called the Pythagorean Theorem because": "0:16",
  "it's named after Pythagoras, a greek philosopher and mathematician. Let's jump into": "0:22",
  "our examples and see exactly what this all means and looks like, starting with number": "0:29",
  "one, where we have a right triangle. Now remember, the Pythagorean Theorem applies": "0:35",
  "to only right triangles. Before we get started with the specifics of the Pythagorean": "0:41",
  "Theorem, we need to take a look at the sides of this triangle and we are going to start with this side right here,": "0:47",
  "the side directly across from the right angle. This is called the": "0:55",
  "hypotenuse.": "1:03",
  "The hypotenuse is the longest side of a right triangle. And again, it will be across": "1:08",
  "from, or opposite of, the right angle. This is something we need to recognize and": "1:14",
  "know when it comes to the Pythagorean Theorem. Then we have the other two shorter": "1:21",
  "sides. So this side right here and this side right here. These are called the legs.": "1:27",
  "So this is a leg and this is a leg. The Pythagorean Theorem states that the sum of": "1:33",
  "the legs squared will equal the hypotenuse squared. So the length of the legs squared,": "1:40",
  "add those together, and that will equal the hypotenuse squared. And that probably": "1:47",
  "sounds confusing worded like that, so let's write it out as an equation, a squared": "1:53",
  "plus b squared equals c squared. So for the Pythagorean Theorem, we use that equation.": "1:59",
  "Again, a squared plus b squared equals c squared. Now a, b, and c all represent a": "2:07",
  "side of the triangle. Let's start with c. Now c is always going to be the hypotenuse.": "2:15",
  "So let's put a c here. And then a and b are going to be the legs. It does not matter": "2:22",
  "which leg is a and which is b. It will work out the same the same either way. So let's call this": "2:30",
  "a and this b. So what we are going to do, we are going to use the pythagorean theorem,": "2:39",
  "the equation a squared plus b squared equals c squared, to figure out the missing": "2:45",
  "side length, this side right here, the hypotenuse. If we know two of the side lengths,": "2:51",
  "we can use the Pythagorean Theorem to figure out the missing side length. Let's plug": "2:58",
  "in the information we know in order to figure out the information we don't know.": "3:05",
  "So we have both of the legs given, a and b, so let's plug those into the equation. a squared": "3:10",
  "plus b squared equals c squared. Again, we are given a and b, so let's plug those in. a is four feet,": "3:20",
  "so four feet squared. Plus b is 3 feet, so 3 feet squared.": "3:24",
  "Equals c squared. Now we can work through this equation and solve for c, so we need": "3:32",
  "to figure out what c equals. Let's start with the left side of the equation. So 4": "3:39",
  "squared plus 3 squared. 4 squared means 4 times 4, so that gives us.": "3:44",
  "16. Plus 3 squared, that means 3 times 3. That gives us 9. Equals c squared. 16 plus": "3:50",
  "9, that equals 25 equals c squared. Now we need to isolate that variable of c and": "4:08",
  "get rid of the exponent of 2. We do that by taking the square root. So let's take": "4:16",
  "the square root of c squared. Now, whatever we do to one side of the equation, we": "4:24",
  "must do to the other. So let's take the square root of 25 as well. Now, as far as": "4:30",
  "the right side of the equation, the variable of c is now isolated. And then for the": "4:39",
  "left side of the equation, the square root of 25 is 5, so c equals 5. Let's rewrite": "4:46",
  "that with the variable first. So c equals 5 and this is feet. So that is our missing": "4:55",
  "side length. This is 5 feet right here. We used the Pythagorean Theorem to figure": "5:02",
  "out the missing side length of that triangle. Now let's take a look at a visual representation": "5:10",
  "of number one and the pythagorean theorem. This is going to help us better understand": "5:17",
  "the Pythagorean Theorem. For number one, we had a right triangle with legs that measured": "5:24",
  "4 feet and 3 feet. The hypotenuse measured 5 feet. So here is that right triangle.": "5:31",
  "Let's find a, b, and c. We will start with the legs. This is a right here and this": "5:40",
  "is b right here. Remember, a and b are always going to be the legs and it doesn't": "5:48",
  "matter which leg is a and which leg is b, they are interchangeable, so keep that": "5:54",
  "in mind. And then we have the hypotenuse, which is always c. The hypotenuse is the": "6:00",
  "longest side, the side across from, or opposite of, the right angle. So this is c.": "6:07",
  "Now let's take all of those sides of this triangle and square them. And we're actually": "6:15",
  "going to make a square on each side. This is a right here, so a. This is b,": "6:22",
  "so b. And then this is c right here, so c. The areas of the two smaller squares, the legs, actually add up": "6:30",
  "to the area of the large square of the hypotenuse. So the two smaller squares combined": "6:36",
  "equal the large square. So the sum of the legs squared, so square those side lengths": "6:44",
  "and add them together, and that sum is going to equal the hypotenuse squared, so": "6:51",
  "that side length squared. That's what the Pythagorean Theorem states. So let's square": "6:58",
  "each side length to find the area of each square on the sides of the triangle to": "7:04",
  "show that this is true. For a, the area of that square is 16 square feet. For b,": "7:12",
  "the area of that square is 9 square feet.": "7:17",
  "And then for c, the area of that square is 25 square feet. So again, the areas of the two smaller squares, the legs, add up": "7:26",
  "to the area of the large square, the hypotenuse. 16 square feet plus 9 square feet equals": "7:30",
  "25 square feet. So a squared plus b squared equals c squared. So it's pretty cool": "7:37",
  "how that relationship works out for every right triangle. Now let's plug in a, b,": "7:43",
  "and c into the equation to write it out that way as well. So we have": "7:50",
  "a squared plus b squared equals c squared. Now we can plug in a, b, and c. So a is": "7:58",
  "4 feet, so 4 squared. b is 3 feet, so 3 squared. Plus c is 5 feet, so 5 squared.": "8:04",
  "4 squared is 16, plus 3 squared is 9, plus 5 squared is 25. 16 plus 9 is 25, so 25": "8:11",
  "equals 25. Now obviously that's true, 25 does equal 25. So the relationship between": "8:19",
  "the sides holds true through that equation. We have the legs represented on the left": "8:25",
  "side of the equation, a squared plus b squared. The sum of those legs squared was": "8:31",
  "25. And then the hypotenuse is represented on the right side of the equation, we": "8:37",
  "have c squared. The hypotenuse squared was also 25. So there you have it, there is": "8:42",
  "a visual representation of the pythagorean theorem. Now let's move on to number two.": "8:51",
  "For number two, we have a right triangle with given side lengths of 15 cm and 17 cm,": "9:19",
  "and then we have a missing side length. Now for this one, we have a leg given and": "9:26",
  "the hypotenuse given. So let's call this a,": "9:34",
  "this b, so this is the missing side length, and then this c. Remember, c always has": "9:41",
  "to be the hypotenuse and then a and b are the legs. It doesn't matter which leg is": "9:46",
  "a and which is b. Now we can plug in what we are given into the equation a squared": "9:54",
  "plus b squared equals c squared and solve for the missing side length. So a squared": "10:01",
  "plus b squared equals c squared. We’ll, we are given a 15 cm, so 15 cm squared plus b squared. We": "10:06",
  "need to figure out what b is, so leave it as b squared. Equals c squared. Well, c": "10:16",
  "is 17 cm, so 17 centimeters squared. Now let's work through this equation and figure": "10:28",
  "out b equals. We will start with 15 squared. That means 15 times 15. That gives us": "10:36",
  "225, plus b squared equals 17 squared. That means 17 times 17. That gives us": "10:44",
  "289. Now we need to continue to work to isolate that variable. So let's subtract 225": "10:53",
  "from the left side of the equation. Whatever we do to one side of the equation, we": "11:06",
  "must do to the other other. So let's subtract 225 from this side of the equation": "11:15",
  "as well. The 225s on the left side of the equation cancel each other out, so we have b squared": "11:21",
  "equals, and then on the right side of the equation we have 289 minus 225. That equals": "11:28",
  "64. So we have b squared equals 64. We need to isolate that variable of b. Since": "11:38",
  "we are squaring b, we have an exponent of 2, we need to take the square root in order": "11:47",
  "to isolate that b. Whatever we do to one side of the equation we must do to the other,": "11:56",
  "so we have the square root of 64 as well. The b is now isolated. Equals and then": "12:02",
  "the square root of 64 is 8. So b equals 8 and this is centimeters.": "12:08",
  "This is our missing side length, so b": "12:16",
  "is 8 cm. So there you have it. There's an introduction to the pythagorean theorem.": "12:25",
  "I hope that helped. Thanks so much for watching. Until next time. Peace.": "12:37"
}
